Original data: (5404, 63) (5404, 2)
minX/maxX/meanX/stdX/miny/maxy: 0.0 59.0 0.740248258198 2.35919268164 4.39033 107.044
Creating model...
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 100, 63)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 100, 512)          1179648   
_________________________________________________________________
dropout_1 (Dropout)          (None, 100, 512)          0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 512)               2099200   
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 1026      
=================================================================
Total params: 3,279,874
Trainable params: 3,279,874
Non-trainable params: 0
_________________________________________________________________
Preparing gradient function...
Calculating gradients...
test shape: (541, 63) (541, 2)
last piece to add
After sliding window: (442, 100, 63) (442, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-1.hdf5
test shape: (541, 63) (541, 2)
last piece to add
After sliding window: (442, 100, 63) (442, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-2.hdf5
test shape: (541, 63) (541, 2)
last piece to add
After sliding window: (442, 100, 63) (442, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-3.hdf5
test shape: (541, 63) (541, 2)
last piece to add
After sliding window: (442, 100, 63) (442, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-4.hdf5
test shape: (540, 63) (540, 2)
last piece to add
After sliding window: (441, 100, 63) (441, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-5.hdf5
test shape: (540, 63) (540, 2)
last piece to add
After sliding window: (441, 100, 63) (441, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-6.hdf5
test shape: (540, 63) (540, 2)
last piece to add
After sliding window: (441, 100, 63) (441, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-7.hdf5
test shape: (540, 63) (540, 2)
last piece to add
After sliding window: (441, 100, 63) (441, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-8.hdf5
test shape: (540, 63) (540, 2)
last piece to add
After sliding window: (441, 100, 63) (441, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-9.hdf5
test shape: (540, 63) (540, 2)
last piece to add
After sliding window: (441, 100, 63) (441, 2)
R2192_models/simple_window_scan_R2192_1x1400_seq100_ep50_b64_1-10.hdf5
grads shape: (4414, 100, 63) targets shape: (4414, 2)
Saved gradients and targets to R2192_models/simple_grads_R2192_1x1400_v1
